export default {
    hi: 'Привет)',
    name: 'Илья',
    intro: 'Это мое резюме Senior Frontend Software Engineer',
    contact_me: 'Связаться со мной',
    experience: 'Коммерческий опыт',
    job_description: 'Чем занимался на этой позиции',
    projects: 'Проекты',
    this_project: "этот проект на github",
    menu: {
        about: 'Главная',
        experience: 'Опыт',
        artifacts: 'Артефакты',
        contact_me: 'Контакты',
        projects: 'Проекты',
    },
    exp: {
        xls: {
            title: 'XL Software',
            position: 'Creator / Middle+ Fullstack Software Engineer',
            more_link: '#experience',
            more_label: 'xlsft.ru',
            history: 'XL Software - команда энтузиастов из 3 человек, однажды собравшаяся покорять горы. Горы покорить им было не суждено, а пути разошлись, но дух и идея все еще живет в их сердцах',
            job: `Занимался сбором и анализом статистических данных, проводил личные интервью с профильными экспертами.<br>
            Разрабатывал BPMN- и UML-диаграммы, проектировал REST- и GraphQL-API.<br>
            Документировал функциональность и создавал пользовательские инструкции для будущих владельцев продукта.<br>
            Проектировал архитектуры различной сложности — от монолитных до микросервисных.<br>
            Также активно участвовал в разработке: писал большое количество кода.<br><br>
            github: <a target="_blank" href="https://github.com/xlsft">xlsft</a>
            `,
            duration: 'Октябрь 2020 — Январь 2023 / 2 года 4 месяца'
        },
        ained: {
            title: 'Ained Ecosystem',
            position: 'Lead / Senior Frontend Software Engineer',
            more_link: 'https://pro.ained.ru',
            more_label: 'pro.ained.ru',
            history: '<b>Ained Ecosystem</b> — это не просто CRM, а живой организм, выросший из желания упростить и ускорить процессы в продажах. Здесь всё строится вокруг гибкости: настраиваемый канбан под любой отдел, интеграции с внешними компаниями и агентствами, виджеты, которые не привязаны к одному экрану — они живут в Telegram, на сайте и даже в чужих CRM. Это не платформа, а среда, где бизнес-процессы становятся твоими собственными, а возможности — только расширяются.',
            job: `Разрабатывал фронтенд на Vue 3 / Nuxt и React для B2B2C CRM-системы, предназначенной для застройщиков. Отвечал за архитектуру клиентской части, разработал собственную библиотеку компонентов и сформировал единую стилистическую концепцию интерфейса.<br>
            Создавал сложные пользовательские интерфейсы с акцентом на удобство и производительность — как для наших клиентов, так и для их конечных пользователей. Перевёл ключевые модули в микрофронтенды и внедрил функционально-ориентированную архитектуру (FSD) в основную часть продукта.<br>
            Полностью спроектировал, реализовал и довёл до продакшена один из базовых элементов системы — <b>виджет для сайтов застройщиков и агентств</b>, включая его бэкенд-часть. Сейчас он используется большим количеством застройщиков и обработал больше миллиарда рублей в заявках.<br>
            Также разработал приложение для Битрикс24 с интеграцией в продукт Ained Catalog (шахматка для застройщика).<br><br>
            Победитель премии Urban 2024: <a target="_blank" href="https://uawards.ru/awards/federalnaya-premiya-urban-2024?nomineeId=5662">Подробнее</a><br>
            Демо виджета: <a href="/demo/ained_widget">Открыть</a><br>
            Продукт в проде: <a target="_blank" href="https://rss48.ru/">rss48.ru</a> <a target="_blank" href="https://авторский48.рф/">авторский48.рф</a> и не только...`,
            duration: 'Февраль 2023 — Март 2025 / 2 года 2 месяца'
        },
        briskly: {
            title: 'Briskly',
            position: 'Senior Frontend Software Engineer',
            more_link: 'https://briskly.online',
            more_label: 'briskly.online',
            history: 'Briskly — технологии будущего для ритейла без очередей и персонала. Управление — только через мобильное приложение, а весь контроль — в одном касании. Это автономная торговля, где оборудование проектируется, собирается и отгружается на собственном заводе в Выборге. Каждый элемент — под полным контролем. Briskly меняет подход к рознице, делая её умной, быстрой и независимой.',
            job: `Разрабатывал фронтенд на чистом Vue для high-load сервиса с многотысячной аудиторией. Поддерживал и оптимизировал обширную кодовую базу, что позволило значительно снизить нагрузку на техническую поддержку по фронтенду.<br>
            Реализовывал интерфейсы для управления различными хардварными устройствами: интерактивными медиаэкранами, кофемашинами, микромаркетами, POS-терминалами, автономными заправками, термостатами и другими IoT-устройствами.<br>
            Построил стабильный, качественный и самодостаточный фронтенд, что позволило существенно сократить издержки компании на поддержку и сопровождение продукта.`,
            duration: 'Март 2025 — настоящее время / 5 месяцев'
        }
    },
    contact: {
        company_name: 'Название компании или имя',
        company_name_placeholder: 'Как к вам можно обращаться?',
        company_info: 'Расскажите о компании или о себе',
        company_info_placeholder: 'Напишите сюда любую информацию которую вы считаете интересной)',
        contacts: 'Контакт(ы) для обратной связи',
        contacts_placeholder: 'Введите любой удобный вам способ обратной связи',
        submit_form: 'Отправить форму',
        via_telegram: 'Связаться в Telegram',
        thanks: 'Спасибо!',
        i_contact_you: 'Я уже получил вашу заявку и свяжусь с вами в ближайшее время!',
        accept_policy: 'Нажимая кнопку "Отправить форму" вы соглашаетесь с обработкой персональных данных и <a href="/legal/privacy" >политикой конфиденциальности</a>'
    },
    yes_its_written_in_nuxt: 'Да, я склепал это на наксте за пару часов',
    curiosity: 'Любопытной варваре на базаре нос оторвали, знал?',
    mailto_subject: 'xlsft.ru: ',
    github: 'github',
    no_items: 'Элементов подходящих для запроса не найдено...',
    project: {
        ained_widget: {
            name: 'Ained Widget',
            description: 'Ультимативный виджет на сайт застройщика. Интерактивные шахматки, планы, инфраструктуры. Гибкие фильтры для покупателя. Все данные как на ладони',
        },
        ained_developer: {
            name: 'Ained Developer',
            description: 'Отраслевая экосистема для застройщика. Конвертируйте фиды в удобный для менеджеров формат, перенесите все рабочие процессы и даже больше из Excel в Ained Developer',
        },
        briskly_business: {
            name: 'Briskly Business',
            description: 'ERP - система для владельцев торговых точек Briskly',
        },
        ained_b24: {
            name: 'Ained Catalog',
            description: 'Приложение для Bitrix24 с интеграцией в Ained Developer',
        },
        work_russia: {
            name: 'Путеводитель “Работа России”',
            description: 'Путеводитель по кадровым центрам “Работа России”. Создан для удобной навигации новых клиентов организации в помещении',
        },
        xlsft_nuxt: {
            name: 'xlsft/nuxt',
            description: 'Удобная библиотека для взаимодействия с Nuxt, используется в проде почти во всех моих Nuxt проектах, и вам советую)',
        },
        ained_widget_bot: {
            name: 'Ained Заявки',
            description: 'Бот заявок для застройщика',
        },
        smartshell_sdk: {
            name: 'SmartShell SDK',
            description: 'Современное, полностью типизированное, динамически генерирующееся, постоянно актуальное SDK для взаимодействия с публичным API ERP системы управления компьютерными клубами SmartShell',
        },
        xlkbd: {
            name: 'XLKBD 01-B',
            description: 'Проект ортолинейной механической с светодиодной матрицей для вывода мета информации',
        },
        htsx: {
            name: 'HTSX',
            description: 'Экспериментальный фулл-стак SSR фреймворк для Deno основанного на ванильном HTML. Работает используя file-based роутинг',
        },
        xlui: {
            name: 'XL Software UI (Legacy)',
            description: 'v0 UI - кита студии XL Software, отправлен в небытие, хоть и используется в проде до сих пор',
        },
        gizmo_parser: {
            name: 'Gizmo Parser',
            description: 'Move from old solution with old clients',
        },
        yasearch: {
            name: 'Firefox Yandex Search',
            description: 'Добавляет поисковой движок Яндекса с доменом ya.ru в Mozilla Firefox и обновленный дизайн иконок',
        },
        cyber_bot: {
            name: 'Cyber Arena Game Bot',
            description: 'Игровой бот с системой лояльности',
        },
    }

}